export const Chalets = [
  {
    id: 1,
    name: "شاليه البحر الأحمر 1",
    title: "شاليه رقم 1 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 1 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 1 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    img: "../src/assets/images/chalet-img.png",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
  },
  {
    id: 2,
    name: "شاليه البحر الأحمر 2",
    title: "شاليه رقم 2 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 2 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 2 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 3,
    name: "شاليه البحر الأحمر 3",
    title: "شاليه رقم 3 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 3 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 3 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 4,
    name: "شاليه البحر الأحمر 4",
    title: "شاليه رقم 4 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 4 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 4 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 5,
    name: "شاليه البحر الأحمر 5",
    title: "شاليه رقم 5 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 5 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 5 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 6,
    name: "شاليه البحر الأحمر 6",
    title: "شاليه رقم 6 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 6 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 6 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 7,
    name: "شاليه البحر الأحمر 7",
    title: "شاليه رقم 7 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 7 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 7 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 8,
    name: "شاليه البحر الأحمر 8",
    title: "شاليه رقم 8 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 8 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 8 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
  {
    id: 9,
    name: "شاليه البحر الأحمر 9",
    title: "شاليه رقم 9 - تجربة فاخرة لعطلتك المثالية",
    description:
      "شاليه رقم 9 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى! شاليه رقم 9 يُقدم لك تجربة استثنائية تجمع بين الرفاهية والاستجمام. سواء كنت تبحث عن مكان هادئ لقضاء إجازة مع العائلة أو أجواء ممتعة مع أصدقائك، يوفر لك الشاليه كل ما تحتاجه من مرافق وخدمات عصرية تضمن راحتك واستمتاعك. استيقظ على صوت الأمواج، واستمتع بجلسة الشاي في حديقة خاصة أو بالسباحة في مسبحك الشخصي. شاليه مثالي لقضاء لحظات لا تُنسى!",
    city: "الرياض، حي النخيل",
    price: "1000 رس",
    gallery: [
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
      "../src/assets/images/105998835_3107044799372571_6023907846948095579_o 1.png",
      "../src/assets/images/apollo-residence-vizualizacia-3 1.png",
    ],
    img: "../src/assets/images/chalet-img.png",
  },
];
