
export default function Privacy() {
    return (
        <div className="bg-blue-50 mb-5 p-12">
            <h1 className="text-3xl font-semibold text-center">سياسة الخصوصية</h1>
            <h1 className="text-2xl font-semibold">مقدمه</h1>
            <p className="mb-5 text-2xl">نحن في smarch نحرص على حماية خصوصيتك ونعمل على تأمين
                بياناتك وفقًا لأفضل الممارسات. توضح هذه السياسة كيفية جمع بياناتك واستخدامها عند استخدام خدماتنا.</p>
            <h1 className="text-2xl font-semibold">البيانات التي نقوم بجمعها</h1>
            <p className="mb-5 text-2xl"> عند التسجيل كمالك (أونر) أو كمستخدم، نقوم بجمع معلومات أساسية مثل الاسم، البريد الإلكتروني، ورقم الهاتف. يتم استخدام هذه البيانات لإنشاء الحساب وتقديم تجربة مستخدم سلسة على الموقع.
                أما بيانات الحجز، فيتم جمعها فقط عند إجراء الحجز وليس أثناء التسجيل. </p>
            <h1 className="text-2xl font-semibold"> كيفية استخدام البيانات </h1>
            <p className="mb-5 text-2xl"> نستخدم البيانات المسجلة لتمكيالمستخدمين من إدارة ممتلكاتهمأو حجوزاتهم، وتحسين
                تجربة الموقع، والتواصل بشأن الحجوزات أو الاستفسارات، والامتثال للمتطلبات القانونية والتنظيمية.
            </p>
            <h1 className="text-2xl font-semibold">مشاركة البيانات</h1>
            <p className="mb-5 text-2xl"> نحن لا نبيع أو نشارك بيانات
                مع أي جهة خارجية، إلا إذا كان ذلك ضروريًا لتقديم الخدمة، مثل مشاركة تفاصيل الحجز مع مقدمي الخدمات، أو إذا طلب ذلك بموجب القانون.
            </p>
            <h1 className="text-2xl font-semibold">حماية البيانات</h1>
            <p className="mb-5 text-2xl"> نعتمد إجراءات أمان تقنيةوإدارية لحماية بياناتك من الوصول غير المصرح به، أو التعديل، أو الكشف، أو الفقدان.</p>
            <h1 className="text-2xl font-semibold">ملفات تعريف الارتباط (Cookies)</h1>
            <p className="mb-5 text-2xl"> يستخدم الموقع ملفات تعريف الارتباط لتحسين الأداء وتقديم تجربة مخصصة. يمكنك إدارة إعدادات ملفات تعريف الارتباط من خلال متصفحك.
            </p>
            <h1 className="text-2xl font-semibold">حقوقك</h1>
            <p className="mb-5 text-2xl"> يمكنك طلب تعديل أو حذف بياناتك، أو إيقاف تلقي الاتصالات التسويقية في أي وقت من خلال التواصل معنا عبر البريد الإلكتروني.
            </p>
            <h1 className="text-2xl font-semibold">التعديلات على السياسة</h1>
            <p className="mb-5 text-2xl"> قد نقوم بتحديث سياسة الخصوصية من وقت لآخر. سيتم نشر أي تغييرات على هذه الصفحة لضمان الشفافية.
            </p>
            <h1 className="text-2xl font-semibold">الاتصال بنا</h1>
            <p className="mb-5 text-2xl"> لأي استفسارات حول سياسة الخصوصية، يمكنك التواصل معنا عبر البريد الإلكتروني أو من خلال وسائل الاتصال المتاحة على الموقع.
            </p>

        </div>
    )
}
