
export default function FAQ() {
    return (
        <div className="bg-blue-50 mb-5 p-12">
            <h1 className="text-3xl font-semibold text-center">  الأسئلة الشائعة</h1>

            <h1 className="text-2xl font-semibold">كيف يمكنني التسجيل في الموقع؟</h1>
            <p className="mb-5 text-2xl"> يمكنك التسجيل بسهولة عن طريق إدخال اسمك، بريدك الإلكتروني، ورقم هاتفك. بعد ذلك، يمكنك تسجيل الدخول إلى حسابك وإدارة الحجوزات أو إضافة الشاليهات إذا كنت مالكًا. </p>
            <h1 className="text-2xl font-semibold">كيف يمكنني إضافة شاليه أو فندق؟</h1>
            <p className="mb-5 text-2xl"> إذا كنت مالكًا، يمكنك تسجيل الدخول إلى حسابك والانتقال إلى لوحة التحكم لإضافة الشاليهات أو الفنادق، مع تحميل الصور وتحديد الأسعار والتفاصيل الأخرى. </p>
            <h1 className="text-2xl font-semibold">كيف أقوم بحجز شاليه أو فندق؟</h1>
            <p className="mb-5 text-2xl"> بعد تسجيل الدخول، يمكنك تصفح الشاليهات والفنادق المتاحة، اختيار ما يناسبك، ثم تأكيد الحجز وفقًا للتعليمات الظاهرة على الموقع. </p>
            <h1 className="text-2xl font-semibold">هل يمكنني إلغاء الحجز؟</h1>
            <p className="mb-5 text-2xl"> سياسة الإلغاء تختلف من مالك لآخر، لذا يُفضل مراجعة سياسة الإلغاء الخاصة بالشاليه أو الفندق قبل تأكيد الحجز. في حال رغبتك في الإلغاء، تواصل مع المالك مباشرة. </p>
            <h1 className="text-2xl font-semibold">هل يمكنني تعديل حجزي بعد تأكيده؟</h1>
            <p className="mb-5 text-2xl"> يعتمد ذلك على سياسة المالك، يمكنك التواصل معه مباشرة لطلب أي تعديلات على الحجز </p>
            <h1 className="text-2xl font-semibold">ما هي طرق الدفع المتاحة؟</h1>
            <p className="mb-5 text-2xl"> يتم تحديد طرق الدفع من قبل المالكين، ويمكنك معرفة الخيارات المتاحة عند تأكيد الحجز. </p>
            <h1 className="text-2xl font-semibold">هل الموقع مسؤول عن جودة الخدمة؟</h1>
            <p className="mb-5 text-2xl"> الموقع يعمل كوسيط بين المالكين والمستخدمين، ولا يتحمل مسؤولية جودة الشاليهات أو الفنادق، لكننا نوفر الدعم لحل أي مشكلات قد تواجهك. </p>
            <h1 className="text-2xl font-semibold">كيف يمكنني التواصل مع دعم الموقع؟</h1>
            <p className="mb-5 text-2xl"> يمكنك التواصل معنا من خلال صفحة اتصل بنا أو عبر البريد الإلكتروني المدرج في الموقع. </p>




        </div>
    )
}
